### Отчет по первому спринту

В начале спринта было запланировано 2 глобальные задачи: возможность создавать свои задачи пользователям и удобный интерфейс управления . Эти две большие задачи, в свою очередь, были разбиты на несколько подзадач.

В рамках первой задачи создана база данных с задачами пользователей и их данными для авторизации. Результат работы над этой задачей успешно прошел тесты и задача была отмечена как выполненная. 

Под работой над графическим интерфейсом предполагалось создание приложения и удобного интерфейса для него. Интерефейс был не до конца доработан – недостаточный опыт использования фреймворка QT.

По результатам спринта стало понятно, что создание интерфейса потребовало больше времени, чем было запланировано. Также было потрачено много времени членов команды на изучение фреймворка Qt, используемого в проекте. 

Первый спринт показал, что нужно более тщательно планировать время выполнения задач, в частности рассчитывать время не впритык, а с запасом из-за возникающих проблем и необходимости изучения технологии  процессе ее применения. Также нужно более четко и детально прописывать задачи и разделять их на подзадачи.
